import React from "react";

const Sogl = () => {

    return <div style={{padding: '5vh 5vw', color: '#ffe45a', fontSize:'large'}}>
        <div style={{textAlign: 'center'}}>
            <h1 style={{color: '#ffe45a'}}>Правила участия</h1>
        </div>
        <p>
            В квесте принимают участие жители Республики Башкортостан в возрасте 16-20 лет.<br/>
            При регистрации необходимо ввести на русском языке свои реальные контактные данные: телефон и e-mail, а также настоящие ФИО, место жительства и учебы. Персональные данные используются организаторами исключительно для приглашения на квест, присуждения призовых мест и вручения призов.<br/>
            Будьте внимательны! Если участник указал при регистрации не реальные или ошибочные данные, он теряет возможность получить приз.<br/>
            Если организаторы не могут связаться в течении суток с участником, занявшим призовое место по указанным им контактам, то его приз переходит следующему участнику.<br/>
            Призовой фонд составляет 100 000 рублей. Победителями будут признаны 31 человек с наибольшим количеством баллов. Первые 3 победителей получат призы стоимостью 10000 руб. Следующие 7 победителей получат призы стоимостью 4000 руб. Следующие 21 победителей получат призы стоимостью 2000 руб.<br/>
            Отправляя форму регистрации, пользователь подтверждает свое согласие на хранение, обработку своих персональных данных, а также оценку организаторами своего участия в квесте и публикацию своих имени, фамилии и населенного пункта в списке победителей.<br/>

        </p>
        <b>ВНИМАНИЕ! При повторной регистрации, в зачет принимается только первое прохождение!</b>
        <p>
            Подсчет баллов<br/>
            Пользователю необходимо полностью пройти сюжетный квест для того, чтобы претендовать на квиз.<br/>
            Победители квеста определяется посредством рейтинговой таблицы, построенной на основе полученного игроком количества баллов и времени выполнения квеста.<br/>
            Для получения очков, игроку необходимо отвечать на вопросы, которые появляются во время квеста. Каждый вопрос может дать игроку от -2 до +10 баллов(если количество баллов отрицательное, значит очки вычитаются).<br/>
            При равном количестве баллов, больше преимуществ имеет игрок, у которого наименьшее время прохождения.<br/>
        </p>
    </div>
}

export default Sogl